In [2]:
import pandas as pd

In [3]:


# Create a simple DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30,None],
        'City': ['New York', 'London', 'Paris']}

df = pd.DataFrame(data)
df

      Name   Age      City
0    Alice  25.0  New York
1      Bob  30.0    London
2  Charlie   NaN     Paris

In [11]:
df.dtypes

Name     object
Age     float64
City     object
dtype: object

In [4]:
df.head()

      Name   Age      City
0    Alice  25.0  New York
1      Bob  30.0    London
2  Charlie   NaN     Paris

In [9]:
#df.tail()
df.loc[df['Age'] > 28]

  Name   Age    City
1  Bob  30.0  London

In [11]:
messy_data = pd.DataFrame({
    'country':['USA','Canada'],
    '1990':[100,80],
    '1991': [120,85]
})

In [12]:
display(messy_data)

  country  1990  1991
0     USA   100   120
1  Canada    80    85

In [15]:
tidy_data = messy_data.melt(id_vars=['country'],
    var_name= 'year',
    value_name= 'gdp'
)

display(tidy_data)

  country  year  gdp
0     USA  1990  100
1  Canada  1990   80
2     USA  1991  120
3  Canada  1991   85

In [18]:
combined_data = pd.DataFrame({
    'id': [1,2],
    'measurement': [['height_180','weight_85'],['height_150','weight_75']]
})

combined_data['height'] = combined_data['measurement'].apply(lambda x:int(x[0].split('_')[1]))
combined_data['weight'] = combined_data['measurement'].apply(lambda x:int(x[0].split('_')[1]))

combined_data = combined_data.loc[:,['id','height','weight']]

In [ ]:
patient_data = pd.DataFrame({
    'patient_id': [101, 102],
    'measurements': ['bp_120/80_hr_72', 'bp_130/85_hr_68']
})


patient_data['systolic'] = patient_data['measurements'].apply(lambda x: int(x.split('_')[1].split('/')[0]))
patient_data['diastolic'] = patient_data['measurements'].apply(lambda x: int(x.split('_')[1].split('/')[1]))
patient_data['heart_rate'] = patient_data['measurements'].apply(lambda x: int(x.split('_')[3]))


patient_data = patient_data.loc[:, ['patient_id', 'systolic', 'diastolic', 'heart_rate']]

patient_data

   patient_id  systolic  diastolic  heart_rate
0         101       120         80          72
1         102       130         85          68